{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"input_3": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"conv2d_17": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_2/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_18/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_19/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_18/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_20/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_21/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_20/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_16/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_17/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_16/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/concatenate/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_22/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_23/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_22/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_14/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_15/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_14/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_24/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_25/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_24/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_12/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_13/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_12/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_3/mul", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_17/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "input_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_8/LeakyRelu", "op": "_FusedConv2D", "input": ["input_3", "StatefulPartitionedCall/model_2/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_12/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_12/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_6/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_12/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_13/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_6/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_13/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_12/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_13/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_12/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_6/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_12/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_20/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_12/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_6/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_19/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_6/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_13/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_19/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_20/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_9/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_13/AddV2", "StatefulPartitionedCall/model_2/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_14/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_14/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_7/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_14/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_15/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_7/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_15/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_14/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_15/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_14/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_7/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_14/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_23/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_14/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_7/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_22/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_7/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_15/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_22/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_23/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_10/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_15/AddV2", "StatefulPartitionedCall/model_2/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_16/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_16/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_8/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_16/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_17/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_8/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_17/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_16/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_17/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_16/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_8/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_16/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_26/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_16/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_8/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_25/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_8/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_17/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_25/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_26/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/leaky_re_lu_11/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_17/AddV2", "StatefulPartitionedCall/model_2/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_18/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_18/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_9/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_18/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_19/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_9/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_19/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_18/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_19/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_18/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_9/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_18/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_29/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_18/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_9/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_28/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/leaky_re_lu_11/LeakyRelu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_9/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_19/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_28/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_29/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_19/AddV2", "StatefulPartitionedCall/model_2/up_sampling2d/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_14/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model_2/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_20/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/conv2d_14/Relu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_20/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_10/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/conv2d_14/Relu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_20/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_21/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_10/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_21/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_20/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_21/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_20/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_10/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_20/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_32/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_20/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_10/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_31/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/conv2d_14/Relu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_10/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_21/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_31/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_32/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_21/AddV2", "StatefulPartitionedCall/model_2/tf.__operators__.add_17/AddV2", "StatefulPartitionedCall/model_2/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_2/concatenate/concat", "StatefulPartitionedCall/model_2/up_sampling2d_1/mul"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_15/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/up_sampling2d_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model_2/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_22/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/conv2d_15/Relu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_22/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_11/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/conv2d_15/Relu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_22/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_23/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_11/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_23/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_22/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_23/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_22/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_11/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_22/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_35/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_22/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_11/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_34/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/conv2d_15/Relu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_11/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_23/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_34/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_35/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_23/AddV2", "StatefulPartitionedCall/model_2/tf.__operators__.add_15/AddV2", "StatefulPartitionedCall/model_2/concatenate_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_2/concatenate_1/concat", "StatefulPartitionedCall/model_2/up_sampling2d_2/mul"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_16/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model_2/conv2d_16/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_24/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/conv2d_16/Relu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_24/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.squared_difference_12/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_2/conv2d_16/Relu", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_24/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_25/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_2/tf.math.squared_difference_12/SquaredDifference", "StatefulPartitionedCall/model_2/tf.math.reduce_mean_25/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_24/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_25/Mean", "StatefulPartitionedCall/model_2/tf.__operators__.add_24/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.rsqrt_12/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_24/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_38/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/tf.math.reduce_mean_24/Mean", "StatefulPartitionedCall/model_2/tf.math.rsqrt_12/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.math.multiply_37/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/conv2d_16/Relu", "StatefulPartitionedCall/model_2/tf.math.rsqrt_12/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_25/AddV2", "op": "Sub", "input": ["StatefulPartitionedCall/model_2/tf.math.multiply_37/Mul", "StatefulPartitionedCall/model_2/tf.math.multiply_38/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/tf.__operators__.add_25/AddV2", "StatefulPartitionedCall/model_2/tf.__operators__.add_13/AddV2", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_2/concatenate_2/concat", "StatefulPartitionedCall/model_2/up_sampling2d_3/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_17/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/up_sampling2d_3/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model_2/conv2d_17/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model_2/conv2d_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_17/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model_2/conv2d_17/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_2/conv2d_17/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/model_2/conv2d_13/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_13/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_18/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_19/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_18/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_14/Conv2D/ReadVariableOp", "shape": [4, 4, 256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_14/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_20/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_21/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_20/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_12/Conv2D/ReadVariableOp", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_12/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_16/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_17/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_16/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_1/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_15/Conv2D/ReadVariableOp", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_15/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_22/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_23/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_22/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_11/Conv2D/ReadVariableOp", "shape": [4, 4, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_11/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_14/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_15/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_14/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_2/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_16/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_16/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_24/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_25/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_24/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_10/Conv2D/ReadVariableOp", "shape": [4, 4, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_10/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_12/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.math.reduce_mean_13/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/tf.__operators__.add_12/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/up_sampling2d_3/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_17/Conv2D/ReadVariableOp", "shape": [4, 4, 64, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_2/conv2d_17/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}